tutorials/floatRigidBody/trial_cases/floatRigidBody_partioned_gravity_ground/0.orig/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
      type            waveAlpha;
        waveDictName    waveDict;
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    stationaryWalls
    {
        type            zeroGradient;
    }

    ground
    {
        type            zeroGradient;
    }
    
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
        floatingObject
    {
        type            zeroGradient;
	}
}


// ************************************************************************* //
